<template>
  <div>
    <p>https://docs.google.com/document/d/1SM4W6vU37p_esnTpTliQsWguDa5mIP3oIm5GkIUdD4E/edit?hl=ko&forcehl=1</p>
    <h1>Front-End 면접 질문 및 답변</h1>
    <pre>
    1. 브라우저 렌더링 과정
      렌더링 과정을 간략하게 표현하자면 다음 네가지 과정으로 설명할 수 있습니다.
      1. DOM 트리 구축을 위한 HTML, CSS 파싱
      2. 렌더트리 구축
      3. 렌더트리 배치(레이아웃 혹은 리플로우)
      4. 렌더티르 기르기(페인트) 
    또한 각 과정은 다음과 같이 설명할 수 있습니다. 
      <b>DOM 트리 구축을 위한 HTML,CSS 파싱</b>
    </Pre>
    <pre>
    2. 실행컨텍스트, this, 호이스팅, 클로저
      실행컨텍스트
      어떤 코드가 실행되기 위해서는 각 코드에 대한 환경이 필요합니다.
      예를들어 , console.log(a)라는 코드가 실행되기 위해서는 console이라는 객체, 
      그 객체 내부의 log라는 함수, 
      그리고 a라는 변수가 정의되어 있는 어떤 환경이 필요합니다.
      자바스크립트는 이러한 환경을 객체로 구현하여 스택을 통해 관리하며, 
      이 스택을 통해 관리되는 환경들을 실행컨텍스트라고 부릅니다. 
      즉, 실행컨텍스트란, 코드를 실행하기 위해 필요한 정보들이라고 할 수 있습니다.
      실행컨텍스트는 크게 전역 컨텍스트와 함수 컨텍스트로 나눌 수 있으며, 
      각 컨텍스트는 해당 컨텍스트에 정의된 변수, 함수, 파라미터값들을 나타낸 스코프,
      자기 자신의 스코프와 상위 스코프들을 모아놓은 스코프 체인, 그리고 this를 가지고 있습니다.
      전역컨텍스트는 이름에서 유추할 수 있듯, 모든 컨텍스트의 최상단에 위치하는 전역 환경입니다.



      자바스크립트의 함수 컨텍스트에서는 함수 호출 방식에 따라 this가 가리키는 객체가 달라진다.
      자바스크립트에서 함수는 다양한 방법으로 호출되며, 각 호출 방법과 해당 호출방법에 따른 this값 결정은 다음과 같다.
      
      - 그냥 함수 호출
       앞서 설명한 예제에서처럼, 그냥 함수를 호출하는 경우입니다.
      funtion foo() {
        // foo 내용
      }
      foo();
      
      그냥 함수를 호출하는 경우, this는 전역객체를 가리키게 됩니다. 
      왜냐하면 전역에 선언된 전역함수는 전역객체의 멤버이기 때문입니다.
      실행컨텍스트를 떠올리면 foo부분이 조금 헷갈릴 수가 있습니다.
      그러나, 실행 컨텍스트와 this가 가리키는 어떤 '객체'는 엄연히 다른 존재라는 것을 기억해야합니다.

    </pre>
  </div>
</template>

<script>
export default {

}
</script>

<style>

</style>